      /if not defined (#CONSTANTS)  
      /define #CONSTANTS            
     D TRUE            C                    *ON
     D FALSE           C                    *OFF
      /endif
