**FREE
/if not defined (#API_QRCVDTAQ)
/define #API_QRCVDTAQ
DCL-PR EC#RCVDTAQ EXTPGM( 'QRCVDTAQ' );
 DQName CHAR(10) CONST;
 DQLibrary CHAR(10) CONST;
 DQLength PACKED(5 :0) CONST;
 DQDataDS LIKEDS( DataDS );
 DQWait PACKED(5 :0) CONST;
END-PR;
/endif
