     D EC#RCVDTAQ      PR                   EXTPGM( 'QRCVDTAQ' )
     D  paDQName                     10A     CONST
     D  paDQLib                      10A     CONST
     D  ppDQLen                       5P 0   CONST
     D  pdsDQData                            LIKEDS( dsData )
     D  ppDQWait                      5P 0   CONST
