      /if not defined (#SQLDEF)   
      /define #SQLDEF             
     D stsOK           C                   0
     D stsEoF          C                   100
     D stsNoF          C                   100

     D Loop            S               N   INZ( *ON )
      /endif
