      /if not defined (#API_SYSTEM)
      /define #API_SYSTEM
     D System          PR            10I 0 EXTPROC( 'system' )
     D                                 *    VALUE OPTIONS( *STRING )
      /endif
