**FREE

/IF NOT DEFINED (OPTCTL)

/DEFINE OPTCTL

CTL-OPT MAIN(Main) ALWNULL(*USRCTL) AUT(*EXCLUDE)
        DATFMT(*ISO-) TIMFMT(*ISO.) DECEDIT('0,') ALLOC(*TERASPACE)
        DFTACTGRP(*NO) ACTGRP(*NEW) DEBUG(*YES) USRPRF(*OWNER);

/ENDIF
