**FREE

/IF NOT DEFINED (API_SYSTEM)

/DEFINE API_SYSTEM

DCL-S SystemErrorReturned CHAR(7) IMPORT('_EXCP_MSGID');

DCL-PR system INT(10) EXTPROC('system');
 String POINTER VALUE OPTIONS(*STRING);
END-PR;

/ENDIF
